app/controllers/api/v1/articles_controller.rb

INSERT INTO "articles" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Introduction to Android"], ["content", "# Introduction\n\n"], ["created_at", "2017-07-19 10:35:38.040051"], ["updated_at", "2017-07-19 10:35:38.040051"]]
---
  def create
    @article = Article.new(article_params)

    if @article.save